In [1]:
import pandas as pd

In [2]:
table = pd.DataFrame(columns=('name','age'))

In [3]:
table

Empty DataFrame
Columns: [name, age]
Index: []

In [4]:
table.loc[1] = "Dracrays", 15

In [5]:
table.loc[2] = "Potter, James", 20

In [6]:
table

            name age
1       Dracrays  15
2  Potter, James  20

In [7]:
table.columns

Index(['name', 'age'], dtype='object')

In [10]:
table.head() # returns first five entries

            name age
1       Dracrays  15
2  Potter, James  20

In [11]:
table.tail() # returns last five entries

            name age
1       Dracrays  15
2  Potter, James  20

In [12]:
table.name

1         Dracrays
2    Potter, James
Name: name, dtype: object

In [13]:
table.age

1    15
2    20
Name: age, dtype: object

In [14]:
type(table.age)

pandas.core.series.Series

In [15]:
for i in table.age:
    print(i)

15
20

In [16]:
table[table.age == 15]

       name age
1  Dracrays  15

 `Series` **-> 1D** <br>
 `Dataframe` **-> 2D**

#### Series

In [34]:
 x = pd.Series([6,3,8,6])

In [35]:
x

0    6
1    3
2    8
3    6
dtype: int64

In [36]:
x[1]

3

**Giving custom index**

In [19]:
x = pd.Series([6,3,8,6], index=["q","w","e","r"])

In [20]:
x

q    6
w    3
e    8
r    6
dtype: int64

In [21]:
x["w"] # compared to x[1]

3

In [27]:
x.iloc[2] # but!

8

In [28]:
x[["w","r"]]

w    3
r    6
dtype: int64

In [30]:
age = {"Captain 'Murica": 120, "Iron Man": 30, "Batman": 25, "Thor": 1000}

In [31]:
x = pd.Series(age)

In [32]:
x

Batman               25
Captain 'Murica     120
Iron Man             30
Thor               1000
dtype: int64

In [33]:
x["Batman"]

25

> INDEX OF THE SERIES consists of the KEYs of the dictonary in SORTED order

## DataFrame

In [37]:
data = {
    'name': ['Tim', 'Lim', 'Jim', 'Dim'],
    'age' : [21,42,84,126],
    'ZIP' : ['0011','1122','2233','3344']
}

In [38]:
x = pd.DataFrame(data)

In [39]:
x

    ZIP  age name
0  0011   21  Tim
1  1122   42  Lim
2  2233   84  Jim
3  3344  126  Dim

In [40]:
x = pd.DataFrame(data, columns=['name', 'age', 'ZIP']) # recommended

In [41]:
x

  name  age   ZIP
0  Tim   21  0011
1  Lim   42  1122
2  Jim   84  2233
3  Dim  126  3344

In [42]:
x["name"]

0    Tim
1    Lim
2    Jim
3    Dim
Name: name, dtype: object

In [43]:
x.name

0    Tim
1    Lim
2    Jim
3    Dim
Name: name, dtype: object

### Re-indexing 
Re-indexing does not affects the relationship between data but rather reorders the data in a table

In [45]:
x = pd.Series([6,3,8,6], index=["q","w","e","r"])

In [46]:
x

q    6
w    3
e    8
r    6
dtype: int64

In [47]:
x.index

Index(['q', 'w', 'e', 'r'], dtype='object')

In [48]:
sorted(x.index)

['e', 'q', 'r', 'w']

In [49]:
x.reindex(sorted(x.index)) #reindex takes new list as an argument according to which it'll create a new index.

e    8
q    6
r    6
w    3
dtype: int64

In [50]:
x

q    6
w    3
e    8
r    6
dtype: int64

### Arithmetic Operations:
According to index. If index dosen't match ->NaN

In [51]:
x = pd.Series([6,3,8,6], index=["q","w","e","r"])

In [52]:
y = pd.Series([7,3,5,7], index=["e","q","r","t"])

In [53]:
x+y

e    15.0
q     9.0
r    11.0
t     NaN
w     NaN
dtype: float64